#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.branch.github_branch.branches["xxx_main"] will be created
  + resource "github_branch" "branches" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "xxx"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.branch.github_branch.branches["xxx_mojeDefaultBranch"] will be created
  + resource "github_branch" "branches" {
      + branch        = "mojeDefaultBranch"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "xxx"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.branch.github_branch.branches["yyy_main"] will be created
  + resource "github_branch" "branches" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "yyy"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.branch.github_branch.branches["yyy_mojeDefaultBranch"] will be created
  + resource "github_branch" "branches" {
      + branch        = "mojeDefaultBranch"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "yyy"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.branch.github_branch.branches["zzz_main"] will be created
  + resource "github_branch" "branches" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "zzz"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.branch.github_branch.branches["zzz_mojeDefaultBranch"] will be created
  + resource "github_branch" "branches" {
      + branch        = "mojeDefaultBranch"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "zzz"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.branch.github_branch_default.default_branch["xxx"] will be created
  + resource "github_branch_default" "default_branch" {
      + branch     = "mojeDefaultBranch"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "xxx"
    }

  # module.branch.github_branch_default.default_branch["yyy"] will be created
  + resource "github_branch_default" "default_branch" {
      + branch     = "mojeDefaultBranch"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "yyy"
    }

  # module.branch.github_branch_default.default_branch["zzz"] will be created
  + resource "github_branch_default" "default_branch" {
      + branch     = "mojeDefaultBranch"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "zzz"
    }

  # module.branch.github_branch_protection.protection["xxx"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "mojeDefaultBranch"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.branch.github_repository_file.readme["xxx"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add README.md to doc folder"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            repository: xxx
            jazyk: sql
        EOT
      + file                         = "doc/README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = false
      + ref                          = (known after apply)
      + repository                   = "xxx"
      + sha                          = (known after apply)
    }

  # module.branch.github_repository_file.readme["yyy"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add README.md to doc folder"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            repository: yyy
            jazyk: java
        EOT
      + file                         = "doc/README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = false
      + ref                          = (known after apply)
      + repository                   = "yyy"
      + sha                          = (known after apply)
    }

  # module.branch.github_repository_file.readme["zzz"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add README.md to doc folder"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            repository: zzz
            jazyk: sql
        EOT
      + file                         = "doc/README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = false
      + ref                          = (known after apply)
      + repository                   = "zzz"
      + sha                          = (known after apply)
    }

  # module.branch.time_sleep.wait_for_branches will be created
  + resource "time_sleep" "wait_for_branches" {
      + create_duration = "20s"
      + id              = (known after apply)
    }

  # module.environment.github_repository_environment.envs["xxx_dev"] will be created
  + resource "github_repository_environment" "envs" {
      + can_admins_bypass   = true
      + environment         = "dev"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "xxx"
    }

  # module.environment.github_repository_environment.envs["xxx_produkce"] will be created
  + resource "github_repository_environment" "envs" {
      + can_admins_bypass   = true
      + environment         = "produkce"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "xxx"
    }

  # module.environment.github_repository_environment.envs["xxx_test"] will be created
  + resource "github_repository_environment" "envs" {
      + can_admins_bypass   = true
      + environment         = "test"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "xxx"
    }

  # module.environment.github_repository_environment.envs["yyy_dev"] will be created
  + resource "github_repository_environment" "envs" {
      + can_admins_bypass   = true
      + environment         = "dev"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "yyy"
    }

  # module.environment.github_repository_environment.envs["yyy_produkce"] will be created
  + resource "github_repository_environment" "envs" {
      + can_admins_bypass   = true
      + environment         = "produkce"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "yyy"
    }

  # module.environment.github_repository_environment.envs["yyy_test"] will be created
  + resource "github_repository_environment" "envs" {
      + can_admins_bypass   = true
      + environment         = "test"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "yyy"
    }

  # module.environment.github_repository_environment.envs["zzz_dev"] will be created
  + resource "github_repository_environment" "envs" {
      + can_admins_bypass   = true
      + environment         = "dev"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "zzz"
    }

  # module.environment.github_repository_environment.envs["zzz_produkce"] will be created
  + resource "github_repository_environment" "envs" {
      + can_admins_bypass   = true
      + environment         = "produkce"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "zzz"
    }

  # module.environment.github_repository_environment.envs["zzz_test"] will be created
  + resource "github_repository_environment" "envs" {
      + can_admins_bypass   = true
      + environment         = "test"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "zzz"
    }

  # module.repository.github_repository.repos["xxx"] will be created
  + resource "github_repository" "repos" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository xxx, part of Alza demo task"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "xxx"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.repository.github_repository.repos["yyy"] will be created
  + resource "github_repository" "repos" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository yyy, part of Alza demo task"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "yyy"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.repository.github_repository.repos["zzz"] will be created
  + resource "github_repository" "repos" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository zzz, part of Alza demo task"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "zzz"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

Plan: 26 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>